Revit 2027 API
FabricationPart.MaterialThickness Property
 The material thickness of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MaterialThickness { get; }
Public ReadOnly Property MaterialThickness As Double
	Get
public:
property double MaterialThickness {
	double get ();
}
member MaterialThickness : float with get
Property Value
Double
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace